const { MessageEmbed } = require('discord.js')
const { color } = require('../config.json');

module.exports = {
    name: 'rules3',
    description: 'malakies!',
    async execute(message, args, client) {
        if(!message.member.hasPermission("ADMINISTRATOR")) return;
        const ambulance = new MessageEmbed()
        .setColor(color)
        .setDescription('**```Ambulance```\nΑπαγορεύονται οι διεφθαρμένοι ΕΚΑΒίτες.\n\nΥποχρέωση σας όταν βρίσκεται εντός υπηρεσία να είστε στον ασύρματο.\n\nΌλοι οι υπάλληλοι του Ε.Κ.Α.Β. θα πρέπει να πηγαίνουν στις κλήσεις μόνο με τα υπηρεσιακά τους οχήματα και με τα υπηρεσιακά τους ρούχα.\n\nΌταν πάτε off duty θα πρέπει να αλλάζετε τον ρουχισμό σας και να αποθηκεύετε το υπηρεσιακό σας όχημα στο garage του Ε.Κ.Α.Β.\n\nΑπαγορεύεται αυστηρά να σηκώσετε τραυματία από έκρηξη, κάψιμο, πνιγμό ή πτώση από ύψος.\n\nΑπαγορεύεται αυστηρά να σηκώσετε ένα τραυματία με 0 ως 5 παλμούς και με 0% ως 15% αίμα\n\nΑπό 5-15 Παλμούς (BPM, Pulse) και απο 15-20 αίμα υποχρεούστε να τον σηκώσετε και να τον φέρετε στο νοσοκομείο (είτε για χειρουργείο, είτε για εξετάσεις). Υποχρεούται ο ασθενής να μεταβεί στο νοσοκομείο.\n\nΑν βρεθείτε σε κλήση όπου μπορεί να σας οδηγεί σε ύποπτα μέρη, redzones, μέρη με ενεργή εγκληματική δραστηριότητα, θα πρέπει να ζητήσετε τη συνοδεία της αστυνομίας.\nΣε περίπτωση που η αστυνομία δεν μπορεί να σας συνοδεύσει υποχρεούστε να μεταβείτε σε ασφαλές μέρος. Απαγορεύεται το Ε.Κ.Α.Β. να πάει στα red zones ή σε ύποπτα σημεία χωρίς την συνοδεία της αστυνομίας.\n\nΑπαγορεύεται να πουλήσει ΕΚΑΒιτης γάζες, παυσίπονα ή οποιοδήποτε άλλο προϊόν του φαρμακείου σε πολίτη. Τις γάζες και τα παυσίπονα τα χρησιμοποιεί αποκλειστικά για να θεραπεύσει ασθενή όχι για πώληση. Οι γάζες και τα παυσίπονα αγοράζονται από το φαρμακείο της πόλης.**')

        message.channel.send(ambulance)
        message.delete()
    },
};