const { MessageEmbed } = require("discord.js");
const { color } = require('../config.json');

module.exports = {
    name: 'rules7',
    description: 'malakies!',
    async execute(message, args, client) {
        if (!message.member.hasPermission("ADMINISTRATOR")) return;

        const rules7 = new MessageEmbed()
            .setColor(color)
            .setDescription('**```Criminal```\nΑπαγορεύεται κάθε είδους εγκληματική ενέργεια κατά τη διάρκεια του PeaceTime.\n\nΓια να μπορεί να πραγματοποιηθεί η οποιαδήποτε εγκληματική ενέργεια θα πρέπει να υπάρχουν τουλάχιστον δύο (3) ενεργούς αστυνομικούς και έναν (1) ΕΚΑΒίτη.\n\nΑπαγορεύεται αυστηρώς να ξεκινήσει η οποιαδήποτε εγκληματική ενέργεια σε οποιοδήποτε SafeZone.\n\nΕπιτρέπονται οι εγκληματικές ενέργειες εντός της πόλης, σε μη κεντρικά σημεία με τη βασική προϋπόθεση να έχει διαδραματηστεί  15`` RP με voice interact.\n\nΑπαγορεύονται οι κλοπές και οι απαγωγές έξω από κάθε μαγαζί.\n\nΣε περίπτωση ληστείας μπορείτε να πάρετε απο το θύμα μόνο οτι έχει πάνω του. (Π.χ Δέν μπορείς να τον αναγκάσεις να σου στείλει λεφτά απο το κινητό η να πάει σε τράπεζα να βγάλει τα λεφτά του).\n\nΤο όριο ατόμων για οποιοδήποτε σκηνικό είναι τα 16 άτομα είτε υπάρχει συμμαχία είτε όχι. Επίσης οι Αστυνομικοί σε οποιοδήποτε σκηνικό δεν πρέπει να ξεπερνούν τα 20 άτομα.\n\nΣε κάποιο σενάριο απαγωγής το μέγιστο χρηματικό ποσό είναι:\nΠολίτης: 20.000$\nΕπιχειρηματίας 30.000$\nΔιοικητής Αστυνομίας/Διευθυντής Ε.Κ.Α.Β: 50.000$\nΔήμαρχος: 150.000$\nΥψηλό πρόσωπο (Πάνω από 2 επιχειρήσεις ή μεγάλης αναγνωρισημότητας άτομο): 100.000$\n(το ποσό είναι υποχρεωτικό να πληρωθεί από τους ίδιους κι όχι από την αστυνομία)\nΜέλος Cartel/Mafia/Gang: 10.000 dirt money ή 25.000 cash\nΑρχηγός Cartel/Mafia/Gang: 20.000 dirt money ή 50.000 cash\n\nΑπαγορεύεται η κλοπή υπηρεσιακών οχημάτων Αστυνομίας και ΕΚΑΒ χωρίς να υπάρχει κάποιος έγκυρος λόγος RP. Επίσης απαγορεύεται αυστηρά η κλοπή αστυνομικού οπλισμού και του εξοπλισμού του ΕΚΑΒ (φάρμακα-γάζες).\n\nΤα Close Contact Weapons (ρόπαλο, μαχαίρι, σιδερογροθιά) δεν μπορούν να απειλήσουν την ζωή κάποιου αν βρίσκεται ένας απο τους δύο μέσα σε όχημα καθώς και σε απόσταση μεγαλύτερη των 2 μέτρων.\n\nΑπαγορεύεται οι criminals να χαλάνε το civilian rp χωρίς να χρησιμοποιησουν σωστα το ρολο τους (troll). Σε περίπτωση που θα θέλετε να πάρετε προστασία από κάποιο μαγαζί θα πρέπει να γίνει με ωραίο τρόπο. Δεν επιτρέπετε το επιθετικό RP που έχει σκοπό να προκαλέσει τον άλλον.\n\nΑπαγορεύεται να πάρεις απαγωγή κάποιον Αστυνομικό χωρίς να έχει πάνω από 9 Αστυνομικούς στην πόλη. Επίσης απαγορεύεται να πάρεις απαγωγή κάποιον από το σώμα του Ε.Κ.Α.Β χωρίς να έχει πάνω από 8 Ε.Κ.Α.Β στην πόλη.\n\nΑπαγορεύεται να κλέψεις κάποιον που κάνει το job του ΟΑΕΔ εντός πόλης αλλά επιτρέπεται αν το job του έχει διαδρομή εκτός πόλης**')

        message.channel.send(rules7)

        const extra = new MessageEmbed()
            .setColor(color)
            .setDescription('**Επιτρέπεται να κλέψεις εκτός πόλης χωρίς προειδοποίησει**')

        message.channel.send(extra)
        message.delete()
    },
};