const { MessageEmbed } = require("discord.js");
const { color } = require('../config.json');

module.exports = {
    name: 'rules1',
    description: 'malakies!',
    async execute(message, args, client) {
        if (!message.member.hasPermission("ADMINISTRATOR")) return;
        const rules1 = new MessageEmbed()
            .setColor(color)
            .setDescription('**```New Life Rule``` \n Όταν πεθάνεις ξεχνάς τα γεγονότα που οδήγησαν στο θάνατό σου. Μπορείς να αποκτήσεις πληροφορίες ξανά για το πως πέθανες μόνο από κάποιον παίκτη που ήταν παρών στο σκηνικό αυτό και έζησε\nΔεν μπορείς να ξαναπάς σε ένα σκηνικό στο οποίο έχεις σκοτωθεί. Περιμένεις την ομάδα σου να τελειώσει.\nΕπιπλέον όταν αποχωρείς από κάποια εγκληματική οργάνωση (gang/mafia/cartel) επιβάλεται να εφαρμώσεις τον κανόνα NLR όσον αφορά την οποιαδήποτε πληροφορία γνώρισες όσο ήσουν σ`αυτη.\nΕάν δεν το κάνεις και αυτό αποδειχτεί (είτε μέσω κάποιου clip, είτε αν το διαπιστώσει κάποιο staff), τότε η ποινή είναι το kill character.**')

        message.channel.send(rules1)

        const rules2 = new MessageEmbed()
            .setColor(color)
            .setDescription('**```Value Of Life(VOL)``` \n Κάνεις τα πάντα για να ζήσεις σε οποιοδήποτε σενάριο όπως θα έκανες και στην πραγματικότητα.\nΓια Παράδειγμα:\nΑπαγορεύεται να σε σημαδεύουν με όπλο και να προσπαθήσεις να τραβήξεις όπλο ή να μιλάς και να συμπεριφέρεσαι σαν να μην σε νοιάζει αν θα πεθάνεις, θα πρέπει να παίζεις ρεαλιστικό αυτό το roleplay.\nΑπαγορεύεται να σημαδεύουν κάποιον δικό σου και να μην σεβαστείς την ζωή του, είτε είσαι criminal είτε είσαι αστυνομικός για παράδειγμα να μην σέβεσαι τα αιτήματα των αντιπάλων που απειλούν τον δικό σου. \n\n ```Out Of Character(OOC)```\nΦερόμαστε και ενεργούμε σαν να βρισκόμασταν στη πραγματική ζωή. Εκφράσεις όπως [server, game, rules, report, afk] κτλ θεωρούνται εκτός χαρακτήρα του παιχνιδιού.\nΟ User είναι υποχρεωμένος να υπακούσει τα <@&904706772558839869>\nΟι παίκτες που χρησιμοποιούν προσβλητική γλώσσα in character δεν πρέπει να το χρησιμοποιούν υπερβολικά και πρέπει να σταματήσουν εάν τους ζητηθεί out of character (OOC)\nΈνα σενάριο μπορεί να βγει εκτός χαρακτήρα ή να τεθεί σε παύση μόνο από τα <@&904706772558839869>**')

        message.channel.send(rules2)

        const rules3 = new MessageEmbed()
            .setColor(color)
            .setDescription('**```Άρνηση RP```\nΑπαγορεύεται να αρνηθείς να παίξεις ένα σκηνικό\nΓια Παράδειγμα:\nΚάποια ομηρεία\n\n```Bad Manners(BM)```\nΑπαγορεύεται να σκοτώσετε κάποιον και να πάτε πάνω από το πτώμα του και να τον βρίσετε/προσβάλλετε.\n\n ```Powergaming/Abuse```\nΑπαγορεύεται να εκτελείς ενέργειες εντός παιχνιδιού που στην πραγματική ζωή δεν θα μπορούσες.\nΝα εκμεταλλεύεσαι τα emotes, να εκμεταλλεύεσαι όποιο είδους bug σου δίνει πλεονέκτημα απέναντι   στους υπόλοιπους ή χρήση μέσων που δεν υπάρχουν στο παιχνίδι.\nΑπαγορεύεται ενώ έχετε πέσει από πυροβολισμούς να σας σηκώσει το Ε.Κ.Α.Β. και να συνεχίσετε σαν να μην έχει συμβεί τίποτα.\nΝα τρακάρεις και μετά από 10 τούμπες να συνεχίζεις με το όχημα σου, σα να μη συνέβει τίποτα.\nΝα χρησιμοποιείς τις ικανότητες σου εκμεταλλευόμενος με αρνητικό τρόπο, για παράδειγμα να είσαι μηχανικός και να ξεκλειδώνεις οχήματα.**')

        message.channel.send(rules3)

        const rules4 = new MessageEmbed()
            .setColor(color)
            .setDescription('**```Random Death Match(RDM)```\nΑπαγορεύεται να να πυροβολήσεις ή να σκοτώσεις ένα παίκτη χωρίς λόγο, χωρίς να έχει προηγηθεί κάποιο RP.\n\n```Kill On Sight(KOS)```\nΑπαγορεύεται να σκοτώσεις κάποιον με μηδενική αλληλεπίδραση. Δικαιολογήσαι μόνο σε περιπτώσεις που διαπράτεις κάποια εγκληματική ενέργεια, η παρουσία σου και η επικυνδυνότητα σου είναι 100% αντιλυπτή και κάποιος user περνάει ύποπτα από το οπτικό σου πεδείο. (Το KOS επιτρέπεται στα RedZones)\n\n```Vehicle Death Match (VDM)```\nVDM είναι το να χτυπήσεις/τραυματίσεις/σκοτώσεις κάποιον user με το όχημα το οποίο οδηγείς και να φύγεις.  Σε οποιαδήποτε φάση αυτό ΑΠΑΓΟΡΕΥΕΤΑΙ, πρέπει να παιχτεί το RP του τροχαίου, να ενδιαφερθείς για τον user που χτυπήσες να καλέσεις ΕΚΑΒ κλπ.**')

        message.channel.send(rules4)

        const rules5 = new MessageEmbed()
            .setColor(color)
            .setDescription('**```Cop Bait```\n\n Απαγορεύεται να κάνεις πράγματα-ενέργειες ώστε να προλαλέσεις τους αστυνομικούς να σε κυνηγήσουν ή γενικά να προκαλείς τους αστυνομικούς. ΠΧ να περνάς με drift ή με κόκκινο μπροστά απ`το τμήμα.\n\n```Call Bait```\nΑπαγορεύεται να καλέσεις οποιαδήποτε δημοσία υπηρεσία ή ιδιωτική επιχείρηση με σκοπό να τον κλέψεις ή να την trollάρεις.\n\n```Combat Log```\nΑπαγορεύεται να βγείς απο το παιχνίδι (ζωντανός ή λιπόθυμος) με οποιοδήποτε τρόπο ενώ βρίσκεσαι στη μέση ενός σκηνικού. Αν είσαι λιπόθυμος περιμένεις να τελειώσει ο χρόνος και να σου δοθεί η επιλογή του respawn (εφόσον σας έχει ελένξει το ΕΚΑΒ) καθώς και όταν σε ενα σκηνικό "λιποθυμάτε" απαγορεύεται να κάνετε respawn και να ξανα μπείτε στο σκήνικο.**')

        const rules6 = new MessageEmbed()
        .setColor(color)
        .setDescription('**```Other```\nΣεβόμαστε τη προσωπικότητα και τα πιστεύω του άλλου. Είμαστε επιθετικοί μέχρι τα πλαίσια του RP μας. Απαγορεύεται να βρίσετε κάποιον σε σημείο που θα θιχτεί irl (in real life), π.χ οικογένειες, μανάδες, πατεράδες, Θεία, ρατσιστικά & σεξιστικά σχόλια.\n\n Σεβόμαστε τη προσωπικότητα και τα πιστεύω του άλλου. Είμαστε επιθετικοί μέχρι τα πλαίσια του RP μας. Απαγορεύεται να βρίσετε κάποιον σε σημείο που θα θιχτεί irl (in real life), π.χ οικογένειες, μανάδες, πατεράδες, Θεία, ρατσιστικά & σεξιστικά σχόλια. \n\n Απαγορεύεται να πουλήσετε ή να μεταβιβάσετε με οποιονδήποτε τρόπο κάποιο donate-mafia car/cartel-mafia-gang/donate house/donate job. \n\n Όποιο job είναι ανενεργό για 7 ημέρες τότε θα παρθεί από την κυβέρνηση είτε είναι από κάποια δημοπρασία είτε είναι από κάποιο donate.\n\nΑπαγορεύεται οποιαδήποτε μορφή spamm - harassment, είτε σε κάποιο chat, είτε discord, είτε μέσω voice-chat. Επιπλέον πολλαπλά άσκοπα και μεμονωμένα report που εμποδίζουν την εξέλιξη του σκηνικού θα αγνοούνται και θα τιμωρούνται.\nΣε σκινηκα που εμπλεκονται 2 ή και περισσοτερα ατομα, report θα κανει κατοπιν συνεννοησεως |ενα| απο αυτά ώστε να αποφευγεται η ασκοπη απασχόληση των <@&904706772558839869>\nReport απο δυο ατομα της ιδιας παρεας στο ιδιο σκηνικο θεωρουνται fail με αποτελεσμα να αγνωουνται και να τημορουντε.\nΔεν κάνουμε άσκοπα (fail) reports.\n\n Σε καμία περίπτωση το ελικόπτερο δεν επιτρέπεται να πετάξει πάνω απο την πόλη σε κοντινή απόσταση απο τα κτήρια καθώς και απαγορεύεται η προσγείωση του σε μη ρεαλιστικές τοποθεσίες. Εκτός πόλης μπορεί να προσγειωθεί όπου είναι το έδαφος κατάλληλο. Φυσικά σε ρεαλιστικά πλαίσια\n\nΑπαγορεύεται η χρήση κράνους από όλους(εκτός από τα αυτόματα της μηχανής), κάλυψη προσώπου γίνεται μόνο με μάσκα\n\n 30 λεπτά πριν από κάθε restart υπάρχει peacetime. Δηλαδή απαγορεύεται οποιαδήποτε εγκληματική ενέργεια.\n\n Απαγορεύεται αυστηρώς το 3rd Party (απαγορεύεται η εμπλοκή τρίτου ατόμου που δεν έχει σχέση με το σκηνικό που βρίσκεται σε εξέλιξη). Σε περίπτωση που κάποια ομάδα/άτομο παραβιάσει τον συγκεκριμένου κανόνα, θα υποβληθούν σοβαρές κυρώσεις.**')

        message.channel.send(rules5).then(message.channel.send(rules6))

        const rules7 = new MessageEmbed()
        .setColor('#FE660A')
        .setDescription('**Η προστασία που μπορεί να παρέχει μια ομάδα σε έναν επαγγελματικό χώρο, θα πρέπει να γίνει μέσω αξιοπρεπούς RP με τον ιδιοκτήτη του καταστήματος. Η παροχή προστασίας θα πρέπει να διευθετηθεί εκτός του μαγαζιού (πχ να κανονίσουν να πάνε κάπου για καφέ ή για επαγγελματικό δείπνο) με τους criminal που το διεκδικούν. Το ανταλαγμα που ζητειτε για τη προστασια του μαγαζιου πρεπει να ειναι σε λογικα πλαισια για την ομαλη διεξαγωγη του rp και την ευχαριστηση και των δυο πλευρων.\n\nΕπιτρέπονται τα clean shot. Πχ να σημαδεύει κάποιος κάποιον δικό σας και να είστε πίσω του 101% σίγουρος ότι δεν υπάρχουν άλλοι αντίπαλοι\nΣε περίπτωση που είναι παραπάνω οι αντίπαλοι δεν μπορείτε να το κάνετε γιατί θα θεωρηθεί VOL\n\nΕάν χάσεις κάποια αντικείμενα από bug ή λόγω απρόβλεπτου restart τότε πρέπει να έχεις τις κατάλληλες αποδείξεις για να σου επιστραφούν πχ κάποιο clipάκι.**')

        const zones = new MessageEmbed()
        .setColor('FE660A')
        .setDescription('**```Safe Zones```\nSafe Zones είναι τα εξής:\n-Δημαρχικό Μέγαρο\n-Δικαστικό Μέγαρο\n-Αστυνομικό Τμήμα\n-Ε.Κ.Α.Β\n-Kεντρική Πλατεία**')
        .setFooter(message.guild.name, message.guild.iconURL())

        message.channel.send(rules7).then(message.channel.send(zones))
        message.delete()
    },
};