const { MessageEmbed } = require('discord.js');
const { color } = require('../config.json');

module.exports = {
    name: 'keybinds',
    description: '!ping',
    async execute(message, args, client) {
        if(!message.member.hasPermission("ADMINISTRATOR")) return;
        const keybinds = new MessageEmbed()
            .setColor(color)
            .setDescription(`**F10\nΑνοίγει τον αποθηκευτικό χώρο από κάποιο όχημα.\n\nU\nΚλειδώνει το κοντινότερο όχημα που ανήκει σε κάποιον παίκτη.\n\nEsc\nΑνοίγει ο χάρτης και οι ρυθμίσεις του FiveM.\n\nF1\nΑνοίγει το κινητό.\n\nF8\nΑνοίγει η κονσόλα του FiveM.\n\nAlt + Y\nΡίχνει σφαλιάρα σε κάποιον παίκτη και εκείνος πέφτει κάτω.\n\nK\nΑνοίγει το μενού για τα αξεσουάρ του παίκτη.\n\nH\nΨάχνει κάποιο παίκτη ενώ σημαδεύεται.\n\nN\nΕάν έχετε το  "Push To Talk" ενεργοποιημένο πρέπει να πατάτε αυτό το κουμπί για να μιλάτε και να σας ακούν.\n\nShift + H\nΜεγαλώνει το εύρος της φωνής σας και επίσης το ευρός για να ακούτε άλλους παίκτες.\n\nF2\nΑνοίγει το μενού για τα αντικείμενα του παίκτη.\n\nF3\nΑνοίγει το μενού για τα emotes.\n\nF5\nΑνοίγει το μενού για τα στοιχεία του παίκτη.\n\nF6\nΑνοίγει το μενού κάποιου job.\n\nF7\nΑνοίγει το μενού για τα προστύμματα ή τις αποδείξεις του παίκτη.\n\nShift + Y\nΣαν αστυνομικός ακινητοποιεί και ρίχνει ένα παίκτη κάτω.\n\nShift + R\nΣαν αστυνομικός περνάει σε ένα παίκτη χειροπέδες.\n\nM\nΑνοίγει το μενού για το vMenu.\n\n,\nΣφυρίζει ο παίκτης.\n\nΒ\nΔείχνει με τον δείκτη του ο παίκτης.\n\nL\nΑνοίγει το μενού για τα documents κάποιου παίκτη.\n\nZ\nΣκύβει στα γόνατα ο παίκτης.\n\nX\nΣηκώνει τα χέρια του ο παίκτης.\n\nΒ\nΌταν είναι σε όχημα βάζει ζώνη ο παίκτης.\n\nX\nΣαν αστυνομικός με πατημένο το κουμπί πέφτει από το ελικόπτερο με σχοινί.\n\nG\nΣταυρώνει τα χέρια του ο παίκτης.\n\nCaps Lock\nΚάνει ότι μιλάει στον ασύρματο του ο παίκτης.\n\nDel\nΣηκώνει ο παίκτης τους δύο αντίχειρες με χαμογελαστή φάτσα.\n\nF\nΒγαίνει από το όχημα ο παίκτης.\n\nΕ\nΑλληλεπιδρα ο παίκτης με κάτι σε σχέση του job του**`)

        message.channel.send(keybinds)
        message.delete()
    },
};