const { MessageEmbed } = require('discord.js');
const { color } = require('../config.json');

module.exports = {
    name: 'rules6',
    description: 'malakies!',
    async execute(message, args, client) {
        if(!message.member.hasPermission("ADMINISTRATOR")) return;

        const rules6 = new MessageEmbed()
        .setColor(color)
        .setDescription('**```Mafia```\nΚάθε μαφία/gang/cartel δεν μπορεί να έχει παραπάνω από 1 σύμμαχο και πρέπει να έχει σταθερό και ξεχωριστό ρουχισμό. Επίσης απαγορεύεται αυστηρώς η συμμαχία μεταξύ gang - gang / mafia - mafia / cartel - cartel\n\nΚάθε μαφία/gang/cartel επιτρέπεται να έχει στο job της έως 20 άτομα. Επίσης απαγορεύεται σε κάποιο σκηνικό να βγάλετε πάνω από 1 ελικόπτερο ενώ υπερασπίζεστε την ομάδα σας, είτε υπάρχει ally είτε όχι.\n\nΑπαγορεύεται το ανούσιο roleplay καψίματος criminal houses.\n\nΜπορείς να κάψεις ένα criminal house μόνο αν υπάρχει ουσιαστικό τουλάχιστον μίας βδομάδας roleplay. (Voice Interacts αλλά και να έχουν συλλεχθει δεδένα όπως ταυτότητες, χρώμα-πινακίδες αυτοκινήτων, πράγματα δηλαδή που ταυτοποιούν την εκαστοτε εγκληματική οργάνωση και τα μέλη της)\nΤο σενάριο καψίματος απαιτεί τουλάχιστον 12 αστυνομικούς μέσα στην πόλη και τουλάχιστον 3 Ε.Κ.Α.Β και τουλάχιστον 10 άτομα από κάθε ομάδα.\nΓια να κάψεις ένα criminal house, θα πρέπει να έχεις προειδοποιήσει πριν 20 λεπτά για την επίθεση.\nΟι επιτιθέμενοι μπορούν να είναι εώς 16 άτομα, ενώ οι αμυνόμενοι εως 30\nΕάν το σπίτι καεί χάνει 40% του αποθέματος της αποθήκης του και κάθε μέλος του μένει αυστηρά εκτός κάθε εγκληματικής ενέργειας για 36h. Και διατηρεί cooldown επίθεσης 7 ημερών.\nΕάν αμυνόμενο σπίτι αμυνθεί επιτυχώς, έχει ασυλία 10 ημερών 30000 μαυρα και κάθε μέλος του σπιτιού λαμβάνει από ένα heavy vest ως επιβράβευση.\n\nΕπιτρέπεται το κάθε cartel/mafia/gang να έχει ως 1 σύμμαχο. (όχι gang - gang / mafia - mafia / cartel - cartel**')

        message.channel.send(rules6)
        message.delete()
    },
};