const { MessageEmbed } = require('discord.js');
const { color } = require('../config.json');

module.exports = {
    name: 'rules2',
    description: 'malakies!',
    async execute(message, args, client) {
        if (!message.member.hasPermission("ADMINISTRATOR")) return;

        const police = new MessageEmbed()
            .setColor(color)
            .setDescription('**```Police```\nΑπαγορεύονται οι διεφθαρμένοι αστυνομικοί. Επίσης απαγορεύεται να πουλήσεις αστυνομικό εξοπλισμό σε οποιονδήποτε παίκτη. Απαγορεύεται να κλέψεις ή να δώσεις αστυνομικό εξοπλισμό να δώσεις πληροφορίες σε criminal.\n\n Είναι υποχρέωση σας όταν βρίσκεται εντός υπηρεσίας να είστε στον ασύρματο και να φοράτε τα ρούχα της δουλειάς σας και να μετακινειστε με τα εργασιακά σας οχήματα.\n\nΕίναι υποχρέωση σας όταν είστε εκτός υπηρεσίας να αλλάζεται ρούχα και να καταθέτεται τον εξοπλισμό στις αποθήκες της αστυνομίας.\n\nΌλοι οι αστυνομικοί θα πρέπει να πηγαίνουν στις κλήσεις και στις περιπολείες, μόνο με τα υπηρεσιακά τους οχήματα και με τα υπηρεσιακά τους ρούχα.\n\nΗ αστυνομία είναι υποχρεωμένη να κάνει value of life σε περίπτωση που έρθει αντιμέτωπη με ομάδες που την δεδομένη στιγμή υπερτερούν.\n\nΑπαγορεύεται να είστε εντώς υπηρεσίας και να είστε AFK ή να κάνετε κάτι άλλο εκτός από αυτά που πρέπει όταν είστε εντός υπηρεσίας.\n\nΓια να κάνει η αστυνομία κάποιο open up θα πρέπει να έχετε ένταλμα από κάποιον εισαγγελέα.\n\nΗ αστυνομία έχει τη δυνατότητα να κάνει δεκτά τα 2 από τα 3 αιτήματα στο Paleto και 3 από τα 4 αιτήματα δεκτά στην κεντρική,επίσης τα παράλογα αιτήματα θα απορρίπτονται.\n\nΗ Αστυνομία απαγορεύεται να κάνει σωματικό έλεγχο σε traffic stop αν δεν υπάρχουν στοιχεία criminal (fullface/οπλοθήκη/τσάντα βάρη οπλισμού/καταδίωξη). Τα Ο.Π.Κ.Ε επιτρέπεται να κάνουν σωματικό έλεγχο για οποιοδήποτε λόγο έκτος πόλης.**')

        const police2 = new MessageEmbed()
            .setColor(color)
            .setFooter(message.guild.name, message.guild.iconURL())
            .setDescription('**Πότε η Αστυνομία ρίχνει πυρά:\nΗ αστυνομία ρίχνει πυρα |ΜΟΝΟ| για να σκασει λάστιχα μετα απο 90`` καταδιωξης. Σε περιπτωση που δεχτει πυρά απο τους criminals πριν ξεκινησει αυτή, δικαιουτε να ρηξει πυρα οπου θελει.\nΑπαγορεύεται η αστυνομία να ρίξει πρώτη, εκτός εάν κάποιος criminal εμφανίσει όπλο (κατα τη διάρκεια της συνάντησης/διαπραγμάτευσης/traffic stop/κλπ) ή σημαδευτεί και έχει clean shot.\n\nΑπαγορεύεται αυστηρώς η αστυνομία να βγάλει πάνω από 2 ελικόπτερα.\n1ο ελικόπτερο: Από 1 εώς 12 criminals.\n2ο ελικόπτερο: Από 12 και πάνω**')

        message.channel.send(police).then(message.channel.send(police2))
        message.delete()
    },
};