const { MessageEmbed } = require("discord.js");
const { color } = require('../config.json');

module.exports = {
    name: 'rules8',
    description: 'malakies!',
    async execute(message, args, client) {
        if(!message.member.hasPermission("ADMINISTRATOR")) return;
        const rules8 = new MessageEmbed()
        .setDescription('**```Robbery```\nΑπαγορεύεται να κάνεις ληστεία 30 λεπτά πριν από το προγραμματισμένο restart.\n\nΟι ληστές πρέπει να αναφέρουν σε [/rob] τον αριθμό των ληστών - εξωτερικών - αν υπάρχει όμηρος και αν επιθυμούν διαπραγμάτευση.\n\nΓια λάβει χώρα κάποια ληστεία θα πρέπει να τηρούνται τα παρακάτω όρια των ατόμων:\nΜαγαζάκι: Από 1 εώς 3 άτομα.\nΚοσμηματοπωλείο: Από 2 εώς 3 άτομα.\nPaleto Bay Bank: Από 3 έως 4 Ληστές.\nΚεντρική Τράπεζα: Από 6 έως 8 Ληστές\n\nΟι αστυνομικοι σε οποιοδηποτε σκηνικο ληστειας ή ομηριας πρεπει να έχουν αριθμητική υπεροχη εναντι των criminals κατα ένα άτομο + να έχουν μαζι τους έναν αοπλο διαπραγματευτη.\nΑπαγορευεται αυστηρα η καθε ειδους εγκληματικη ενεργεια προς τον διαπραγματευτη (πχ η κλοπη του εξοπλισμού του, ή του αυτοκινήτου του)\n\nΤα αιτήματα να είναι λογικά.\n\nΕίστε υποχρεωμένοι να αναφέρετε στον διαπραγματευτή πόσα άτομα εμπλέκονται στο σκηνικό, δηλαδή να αναφέρετε πόσοι ληστές υπάρχουν, αν είναι εσωτερικοί ή εξωτερικοί και άμα υπάρχουν και όμηροι να αναφέρετε πόσοι είναι. Σε περίπτωση που δεν θεωρήσει η αστυνομία σωστή την ενημέρωση  μπορεί να κάνει έφοδο δίχως προειδοποίηση.\n\nΤο τελος της διαπραγματευσης επιβαλεται να ανακοινωθει με announce στο /robbery για τους criminals και στο /ελλας; (δε ξερω ποιο ειναι χχαχααχ) για τους αστυνομικους.\n(Αυτο εχει ως αποτελεσμα την καλυτερη οργανωση αναμεσα στα μελη της καθε ομαδας, ωστε να ειναι 100% συνεννοήσιμοι μεταξυ τους, οταν παρακολουθούν τη διαπραγματευση.)\n\nΑπαγορεύεται να φύγετε από κάποια ληστεία ή ομηρία εάν δεν έρθει η αστυνομία ή εάν δεν υπάρξει τέλος διαπραγμάτευσης.\n\nΚάθε ομάδα έχει cooldown 2 ώρες σε κάθε ληστεία ή ομηρία.\n\nΜπορεί να γίνει ΜΟΝΟ μια ληστεία ταυτόχρονα.**')
        .setColor(color)

        message.channel.send(rules8)
        message.delete()
    },
};