const { MessageEmbed } = require("discord.js");

module.exports = {
    name: 'staffrules',
    description: 'malakies!',
    async execute(message, args, client) {
        if(!message.member.hasPermission("ADMINISTRATOR")) return;
        const staffrules = new MessageEmbed()
            .setColor('#FE660A')
            .setAuthor(message.guild.name, message.guild.iconURL())
            .setDescription(`**STAFF RULES:\n1. Απαγορεύεται να παίξουμε rp με το staff account μας! \n\n 2. Απαγορεύεται να δώσουμε όπλα, αντικείμενα ή και χρήματα σε user, χωρίς να έχουμε τις κατάλληλες αποδείξεις ότι τα έχασε. Αν δώσουμε, πρέπει να ανεβάσουμε τα κατάλληλα αποδεικτικά(screenshot ή clip) \n\n 3. Όταν είμαστε in game με το staff account , είναι αναγκαστικό να φοράμε την ενδυμασία των staff που υπάρχει στο <#909036752193347614> ,να είμαστε στο <#904695320385060904> καθώς επίσης και να σημειώνουμε στο <#907643022697701396> την ώρα που μπήκαμε on duty και την ώρα που βγήκαμε \n\n 4. Για να βάλετε σίγαση απλα ενημερώνετε για να αποφυγετε τυχων spam! \n\n 5. Για να λύσουμε ένα report ,έχουμε πάντα στο μυαλό μας τα  Rules. Η απόφαση όμως είναι στη κρίση του staff,που το έχει αναλάβει. Γιαυτό το λόγο , σε κάθε report πάει μόνο ένα staff. Παρ’όλα αυτά μπορείς να παρακολουθήσεις πάντα με noclip ή invisible. \n\n 6. Είναι πιθανό, να γίνουν διαφορετικά report για το ίδιο σκηνικό με αποτέλεσμα να βρεθούν δύο staff στο συγκεκριμένο μέρος. Σε αυτή τη περίπτωση, θα παραμείνει στο report αυτός που έφτασε πρώτος ή αυτός που έτυχε να δει κάποιες σκηνές του πως εξελίχθηκε το περιστατικό. Ο άλλος είτε θα φύγει από το σκηνικό είτε θα μείνει με noclip ή invisible και θα παρακολουθήσει την επίλυσή του. Αν η απόφαση που έβγαλε το staff το οποίο ανέλαβε το report είναι διαφορετική από αυτή που θα έβγαζες εσύ, του το λες στον ασύρματο. Σε καμία περίπτωση όμως, δεν μπορείς να το πεις μπροστά σε πολίτη. \n\n 7. Αν είσαι με το civilian account σου και γίνει report από την ομάδα σου, όταν έρθει κάποιο staff για να το λύσει , απαγορεύεται να πάρεις μέρος. Αυτό σημαίνει, πως θα αφήσεις να μιλήσει κάποιος άλλος από την ομάδα σου και όχι εσύ. \n\n 8. Όταν δεν μπορούμε να λύσουμε ένα report ή δυσκολευόμαστε, είναι χαζό να μη ζητάμε βοήθεια. Είναι καλύτερα να σου πάρει περισσότερο χρόνο να λύσεις ένα report, από το να αδικήσεις κάποιον. Σε αυτή τη περίπτωση, μπορείς να ζητήσεις τη βοήθεια κάποιου ανώτερου και να σε συμβουλέψει ή και να σε καθοδηγήσει στη σωστή κατά τη γνώμη του επίλυση του report. \n\n 10. Ό,τι πληροφορίες μάθεις ως staff ΑΠΑΓΟΡΕΥΕΤΑΙ ΡΗΤΑ να τις χρησιμοποιήσεις ως πολίτης ή να τις μοιραστείς με κάποιον άλλο πέραν του staff team. Η παραβίαση αυτού του κανόνα ενέχει την άμεση απομάκρυνση σου από staff. \n\n 11. Απαγορεύεται οποιουδήποτε είδους αισχρολογία ή εξύβριση συναδέλφου. Αν υπάρχει κάποιο πρόβλημα με συνάδελφο, μπορείτε να ενημερώσετε κάποιον**`)

        const staffrules2 = new MessageEmbed()
            .setColor('#FE660A')
            .setDescription(`** 12. Όλοι μας έχουμε ανάγκη από ξεκούραση , γιαυτό δηλώνουμε στο on-off season staffs για τυχόν απουσία μας και ποιες ημέρες θα απουσιάζουμε. Η σκόπιμη ή συνεχόμενη αδικαιολόγητη απουσία μας από το <@&904706772558839869>, θα έχει ως αποτέλεσμα τον υποβιβασμό μας ή ακόμη και την απομάκρυνσή μας από το <@&904706772558839869> \n\n Η μη τήρηση των παραπάνω κανόνων θα έχει ως  επίπτωση <#907643205523243029> ή και απομάκρυνση από το <@&904706772558839869>**`)

        message.channel.send(staffrules).then(message.channel.send(staffrules2))
    },
};