const { MessageEmbed } = require("discord.js");

module.exports = {
    name: 'staffguide',
    description: 'malakies!',
    async execute(message, args, client) {
        if(!message.member.hasPermission('ADMINISTRATOR')) return;

        const staffguide = new MessageEmbed()
        .setAuthor(message.guild.name, message.guild.iconURL({ dynamic: true }))
        .setDescription(`**1. <@&904706172672671845> Δουλεία σας είναι η εξυπηρέτηση του WFS (waiting for support) και τίποτε άλλο. Δέν έχετε permission in game. Ο,τι δεν γνωρίζετε απευθύνεστε σε έναν ανώτερο. \n\n 2. <@&904707090780684308>  Συνεχίζετε την δουλεία του trial απλά τώρα έχετε perimission in game. Πηγαίνετε μονο σε report τύπου powergaming,bug,other Εκτός αν δεν είναι ανώτερος μέσα. \n\n 3. <@&904707339771330570> Συνεχίζετε την δουλεία του Helper όμως τώρα πατε σε report ολου του τύπου και δεν δίνετε τοση έμφαση στο WFS (waiting for support) \n\n 4. <@&904707461099978782> Συνεχίζετε την δουλεια του Moderator. Κύριος στόχος σας η γρήγορη επίλυση οποιουδήποτε σκηνικού και η βοήθεια του spawn όπου χρειαστεί \n\n 5. <@&904706049666334761> Πλέον στόχος σας ειναι η παρακολούθηση των αποφάσεων των <@&904706772558839869>. Βοηθάτε και δίνετε τις απαραίτητες συμβουλές οπου χρειαστεί. \n\n 6. <@&904705906057572373>  Στόχος σας η πλήρη παρακολούθηση των <@&904706772558839869> οσο αναφορά την επίλυση ενος report και την συμπεριφορά προς τους users. Συν ο,τι αλλο σας ανατεθεί. \n\n ΓΕΝΙΚΕΣ ΟΔΗΓΙΕΣ:\n1. Ο,τι πρόβλημα έχετε με αλλο <@&904706772558839869> αναφέρεστε στον <@&904710200320196649> ή σε <@&904705906057572373>\n2. Αμα θέλετε κάποια βοήθεια σε ενα report αναφερόσαστε στον <@&904705906057572373> αμα δεν είναι μεσα πάτε με βαση την ιεραρχία. \n\n 3. Δεν ταγκάρουμε ποτε <@&904708339328495636> <@&904708438062420058> χωρίς απαραίτητο λόγο**`)
        .setColor('#FE660A')

        message.channel.send(staffguide)
    },
};